Tekla Open API Reference for Tekla Structures 2025
PlateIntersectsWithIntersectionLineException Fields
The PlateIntersectsWithIntersectionLineException type exposes the following members.
Fields
Name | Description
OperationStatus
 Possible error statuses for geometry creation/modification commands.
 (Inherited from ConnectiveGeometryException.)
Top
See Also
Reference
PlateIntersectsWithIntersectionLineException Class
Tekla.Structures.Model Namespace